Repository: flipsi/wwwmetabeta
Catalog: src/locale/*/LC_MESSAGES/messages.po
Languages: de_de

# subtitle
source: Software Engineer / Musician / Banana Nerd
de_de: Software-Entwickler / Musiker / Bananen-Nerd

source: Home
de_de: Start

source: About Me
de_de: Über mich

source: Wishlist
de_de: Wunschliste

source: Imprint
de_de: Impressum

# toggle_background
source: Background
de_de: Hintergrund

# toggle_dark
source: Dark
de_de: Dunkel

# toggle_bright
source: Bright
de_de: Hell

# home:introduction
source: My name is Philipp. Some people call me Flipsi. I like to craft software, play music and eat %s. %s or find me at one of these:
de_de: Mein Name ist Philipp. Manche nennen mich Flipsi. Ich baue gerne Software, mache Musik und esse %s. %s oder finde mich woanders:

# home:introduction:get_to_know_me
source: Get to know me here
de_de: Lerne mich hier kennen

source: banana
de_de: Banane

# wishlist:h1:introduction
source: Wishlist
de_de: Wunschliste

# wishlist:h1:books
source: Books
de_de: Bücher

# wishlist:introduction
source: I really do have everything I need. Still, every now and then people want to buy me a gift and don't know what I would enjoy. So here is a list of ideas as an inspiration for those people.
de_de: Ich habe wirklich alles, was ich brauche. Es kommt allerdings einigermaßen regelmäßig vor, dass Menschen mir Geschenke machen wollen und nicht wissen, was ich gebrauchen könnte oder worüber ich mich freuen würde. Deswegen hier eine Liste, die es solchen Menschen erleichtern soll, ein Geschenk zu finden.

# wishlist:books
source: ... or perhaps a book?
de_de: ... oder vielleicht ein Buch?

# wishlist:always_nice
source: There are certain things you can't have enough of. I'm always happy if someone brings me the following:
de_de: Von manchen Dingen kann man nicht genug haben. Ich freue mich immer über folgendes:

# wishlist:item:board_games
source: board or card games
de_de: Gesellschafts- oder Kartenspiele

# wishlist:item:chess
source: high quality chess game
de_de: Hochwertiges Schachspiel

# wishlist:item:ultrasonic_cleaner
source: ultrasonic cleaner for glasses
de_de: Ultraschallreiniger für Brillen

# wishlist:item:children_toothbrush
source: electric toothbrush
de_de: elektrische Kinderzahnbürste

# aboutme:cv
source: Curriculum Vitae
de_de: Lebenslauf

# aboutme:interests
source: Interests and Skills
de_de: Interessen und Fähigkeiten

# aboutme:cv:code_intelligence:when
source: November 2022 - present
de_de: November 2022 - jetzt

# aboutme:cv:code_intelligence:what
source: Senior Software Engineer
de_de: Senior Software-Entwickler

# aboutme:cv:ryte:when
source: May 2017 - October 2022
de_de: März 2017 - Oktober 2022

# aboutme:cv:ryte:what
source: Software Engineer
de_de: Software-Entwickler

# aboutme:cv:brainworks:when
source: October 2015 - March 2017
de_de: Oktober 2015 - März 2017

# aboutme:cv:brainworks:what
source: Web Developer
de_de: Web-Entwickler

# aboutme:cv:lmu:what
source: Master of Science (M.Sc.) Media Informatics
de_de: Master of Science (M.Sc.) Medieninformatik

# aboutme:cv:tubingen:where
source: University of Tübingen
de_de: Eberhard Karls Universität Tübingen

# aboutme:cv:tubingen:what
source: Bachelor of Science (B.Sc.) Media Informatics
de_de: Bachelor of Science (B.Sc.) Medieninformatik

# aboutme:thesis
source: Thesis
de_de: Abschlussarbeit

# aboutme:interests:explanation
source: The world is jam-full of things to be curious about. It is my belief that one can self-improve at almost anything by spending time and energy on it. Hence, this is a collection of both, things I am enthusiastic about and more or less good at.
de_de: Das Leben ist voller Dinge, auf die es sich lohnt neugierig zu sein. Ich bin überzeugt, dass man sich fast alles aneignen kann, wenn man nur genug Zeit und Energie darein investiert. Deswegen folgt hier eine Sammlung von beidem - Dingen, die mich faszinieren, und solchen, in denen ich mehr oder weniger gut bin.

# aboutme:interests:scala_and_fp:title
source: Scala and Functional Programming
de_de: Scala und Funktionale Programmierung

# aboutme:interests:scala_and_fp:description
source: There are lots of facts that I love about %s. First and foremost it implements the concepts of %s which I am an absolute fan of. But also it makes writing concise code easy and I do loathe boilerplate.
de_de: Es gibt vieles, was ich an %s liebe. Zuallerst implementiert es die Konzepte von %s, wovon ich ein absoluter Fan bin. Aber außerdem erlaubt es ausgezeichnet, kompakten Code zu schreiben - und ich verabscheue Boilerplate.

# aboutme:interests:scala_and_fp:fp
source: Functional Programming
de_de: Funktionaler Programmierung

# aboutme:interests:reactive_and_streams:title
source: Reactive Systems and Streaming Data
de_de: Reactive Systems und Streams

# aboutme:interests:reactive_and_streams:description
source: In my view, Sofware Engineering is still in an early stage of its development. To build modern and reliable software system of the future, in addition to Functional Programming, carefully designed paradigm frameworks like the %s can lead the way.
de_de: Meiner Meinung nach ist die Kunst der Sofware-Entwicklung noch immer in einer jungen Ära. Um moderne und zuverlässige Software-Systeme zu bauen, sind zusätzlich zu Funktionaler Programmierung weitere gut entworfene Paradigmen hilfreich und nötig, wie zum Beispiel das %s.

# aboutme:interests:bits_and_dbs:title
source: Bits and Databases
de_de: Bits und Datenbanken

# aboutme:interests:bits_and_dbs:description
source: If it's true that %s, I think it's absolutely necessary to spread knowledge about the basics of %s, how bits as the atomic unit of information become structured data, %s and how databases actually work. After all, %s.
de_de: Wenn es wahr ist, dass %s, denke ich, dass Wissen über die Grundlagen der %s, wie Bits als atomare Einheit der Information zu strukturierten Daten werden, %s und wie Datenbanken tatsächlich funktionieren, allgemein mehr Verbreitung finden muss. Letzendlich gilt: %s.

# aboutme:interests:bits_and_dbs:data_is_oil
source: data is the new oil of the 21st century
de_de: Daten das Öl des 21. Jahrhunderts sind

# aboutme:interests:bits_and_dbs:information_theory
source: Information theory
de_de: Informationstheorie

# aboutme:interests:agile_and_communication:title
source: Agile Principles and Communication
de_de: Agile Prinzipien

# aboutme:interests:agile_and_communication:description
source: I wholeheartedly dig the %s, because I think its strength lies in the fact that it's closer to the way humans think and live than other approaches. Whenever I'm convinced that there is a structural issue, I'd rather spend my time discussing it than risking to waste time in unreasoning or inefficient labour.
de_de: Ich vertrete leidenschaftlich gerne das %s, weil ich denke, dass seine Stärke darin bestehe, der menschlichen Natur zu denken und zu handeln, näher kommt, als andere Ansätze. Immer wenn ich ein strukturelles Problem identifiziere, führe ich lieber eine Grundsatzdiskussion als Zeit mit potentiell sinnloser oder ineffizienter Arbeit zu verschwenden.

# aboutme:interests:agile_and_communication:manifesto
source: Agile Manifesto
de_de: Agile Manifest

# aboutme:interests:linux_and_foss:title
source: Linux and Free Software
de_de: Linux und Freie Software

# aboutme:interests:linux_and_foss:description
source: I'm convinced that the existence of Free Software makes the world a better place. Not only that I use Linux - the OS that sucks fewest - personally, I think it also is a matter of public interest and support %s.
de_de: Ich bin überzeugt, dass die Existenz freier Software die Welt zu einem besseren Ort macht. Nicht nur nutze ich deswegen am liebsten Linux - das Betriebssystem, das am wenigsten nervt, sondern sehe auch das notwenige öffentliche Interesse und unterstütze z.B. %s.

# aboutme:interests:vim_and_scripting:title
source: Vim, Scripting and the CLI
de_de: Vim, Scripting und CLI

# aboutme:interests:vim_and_scripting:description
source: Being an absolute Vim addict, %s has over 5000 lines. I love to customize my dev environment - and hate to move my hands away from the keyboard. If I manage to automate another nasty task, it makes me sleep better.
de_de: Als vim-Abhängiger hat %s mittlerweile über 5000 Zeilen. Ich liebe es, meine dev-Umgebung zu optimieren - und hasse es, die Hände von der Tastatur nehmen zu müssen. Wenn ich wieder einmal eine lästige Aufgabe automatisiert habe, kann ich besser schlafen.

# aboutme:interests:vim_and_scripting:my_vimrc
source: my handcrafted .vimrc
de_de: meine handgefertigte .vimrc

# aboutme:interests:maths_and_philosophy:title
source: Mathematics and Philosophy
de_de: Mathematik und Philosophie

# aboutme:interests:maths_and_philosophy:description
source: It fascinates me how intermingled different fields as mathemathics, philosophy and music really are, e.g. the concept of %s can be found everywhere. I'm the happiest whenever a new beautiful %s pops up as I am getting closer to what's at the core of cognition and intelligence. One of the best expressions of this idea may be one of my favorite books: %s.
de_de: Es fasziniert mich, wie ähnlich sich unterschiedliche Domänen wie Mathematik, Philosophie und Musik wirklich sind, zum Beispiel findet sich das Konzept der %s überall wieder. Es macht mich glücklich wenn ich einen %s entdecke, weil es mir das Gefühl gibt, der Wahrheit über Kognition und Intelligenz ein Stück näher gekommen zu sein. Diese Idee steht im Mittelpunkt eines meiner Lieblingsbücher: %s.

# aboutme:interests:maths_and_philosophy:recursion
source: recursion
de_de: Rekursion

# aboutme:interests:maths_and_philosophy:isomorphism
source: isomorphism
de_de: Isomorphismus

# aboutme:interests:maths_and_philosophy:geb
source: GEB by Douglas Hofstadter
de_de: GEB von Douglas Hofstadter

# aboutme:interests:science_and_cr:title
source: Science and Critical Rationalism
de_de: Wissenschaft und Kritischer Rationalismus

# aboutme:interests:science_and_cr:description
source: The most important finding of science was the finding of our own ignorance. The Enlightenment is probably one of the best things that happened to mankind. But from %s to Einstein proving Newton wrong, history makes me humble and I sympathize with the idea of %s.
de_de: Die wichtigste Entdeckung der Wissenschaft ist die Entdeckung des Nichtwissens. Die Aufklärung ist wahrscheinlich eines der besten Dinge, die der Menschheit je passiert sind. Von %s bis Einstein, der bewies, dass Newton falsch lag: Die Geschichte lehrt uns Bescheidenheit und ich sympathisiere mit der Idee des %s.

# aboutme:interests:science_and_cr:cr
source: Critical rationalism
de_de: Kritischen Rationalismus

# aboutme:interests:puzzles_and_problems:title
source: Logical Puzzles and Problem Solving
de_de: Logik-Puzzle und Problemlösen

# aboutme:interests:puzzles_and_problems:description
source: I guess the reason that I enjoy programming so much is that it's like solving a mental puzzle. Nothing beats the satisfaction when one's mind has resolved that state of confusion using logic and creativity to the same extend and turned it into some program that %s.
de_de: Ich glaube ein Grund, warum mir Programmieren so Spaß macht, ist, dass es wie das Lösen eines mentalen Puzzles ist. Nichts schlägt die Befriedigung, wenn man einen Knoten im Kopf mithilfe von Logik und Kreativität aufgelöst und in ein Programm gegossen hat, das %s.

# aboutme:interests:puzzles_and_problems:just_works
source: just works
de_de: einfach funktioniert

# aboutme:interests:music:title
source: Listen to and make Music
de_de: Musik hören und machen

# aboutme:interests:music:description
source: Music is my place of inner peace. From Jazz over Funk and Soul via Electroswing to Hard Rock, I enjoy a broad spectrum - I think of music as I think of food: regularity and diversity matter! People like %s inspire me. Learning to play the piano when I was young, I am now playing electric bass guitar in %s and singing in %s.
de_de: Musik ist ein Ort inneren Friedens für mich. Von Jazz über Funk und Soul via Electroswing bis zu Hard Rock, mir gefallen viele Genres - Musik ist wie Essen für mich: Regelmäßigkeit und Abwechslung sind wichtig! Mich inspirieren Musiker wie %s. Nachdem ich als Kind Klavierspielen lernen durfte, spiele ich nun E-Bass in %s und singe in %s.

# aboutme:interests:music:cantaloupe
source: a Big Band
de_de: einer Big Band

# aboutme:interests:music:catchatune
source: a Jazz choir
de_de: einem Jazzchor

# aboutme:interests:sports:title
source: Table tennis and Rock Climbing
de_de: Tischtennis und Felsklettern

# aboutme:interests:sports:description
source: Table tennis is the sport I grew up with. I love the precision and competition and only plan to retire when I die. Many years ago now, I also discovered rock climbing. The holistic requirements fascinate me and I can really clear my mind being on the wall.
de_de: Tischtennis ist der Sport, mit dem ich aufgewachsen bin. Ich liebe die Präzision und den Wettkampfcharakter und höre erst auf zu spielen, wenn ich sterbe. Vor einigen Jahren habe ich außerdem das Klettern für mich entdeckt. Die ganzheitlichen Anforderungen faszinieren mich und am Fels kann ich wirklich abschalten.

# aboutme:interests:playing_games:title
source: Poker and Board Games
de_de: Poker und Gesellschaftsspiele

# aboutme:interests:playing_games:description
source: Even though I tend to like gambling sometimes, I believe poker isn't about gambling at all. To me, it's just the perfect symbiosis of statistics and psychology. Also it teaches my a lot from the mechanics of capitalism to being a good sport when losing.
de_de: Auch wenn ich manchmal gerne "zocke", ist Poker meiner Auffassung nach kein Glücksspiel, sondern die perfekte Symbiose aus Statistik und Psychologie. Und man kann viel dabei lernen - sei es die Funktionsweise des Kapitalismus oder ein guter Verlierer zu sein.
